### Задача 8.1
Может ли вызов `count = write(fd, buffer, nbytes);` вернуть в переменной count
значение, отличное от значения nbytes? Если да, то почему? Приведите работающий
пример программы, демонстрирующий ваш ответ.

### Задача 8.2
Есть файл, дескриптором которого является fd. Файл содержит следующую
последовательность байтов: 4, 5, 2, 2, 3, 3, 7, 9, 1, 5. В программе выполняется
следующая последовательность системных вызовов:
`lseek(fd, 3, SEEK_SET);`
`read(fd, &buffer, 4);`
где вызов lseek перемещает указатель на третий байт файла. Что будет содержать
буфер, когда завершится работа вызова read? Приведите работающий пример
программы, демонстрирующий ваш ответ.

### Задача 8.3
Библиотечная функция qsort предназначена для сортировки данных любого типа, и
для ее работы необходимо подготовить функцию сравнения, которая будет
вызываться из qsort всякий раз, когда необходимо сравнить два значения.
Поскольку значения могут иметь любой тип, в функцию сравнения передаются два
указателя типа void* на сравниваемые элементы данных.
• Напишите программу, в которой выясните, какие исходные данные являются
наихудшими для алгоритма быстрой сортировки. Попытайтесь найти
несколько массивов данных, которые бы заставили qsort работать как можно
медленнее. Автоматизируйте процесс экспериментирования так, чтобы
подбор и анализ исходных данных выполнялись сами по себе.
• Придумайте и реализуйте набор тестов для проверки правильности функции
qsort.

### Задача 8.4
Выполните следующую программу на языке программирования С:
```
int main() {
 int pid;
 pid = fork();
 printf("%d\n", pid);
}
```
Закончите данную программу и в предположении, что вызов fork () выполнился
успешно, каким может быть вывод этой программы?